api/app/controllers/api/v1/teams_controller.rb

SELECT `teams`.* FROM `teams`
---
      def index
        @teams = Team.all

SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 13 LIMIT 1
---
      def show
        @team = Team.find(params[:id])

INSERT INTO `teams` (`name`, `description`, `created_at`, `updated_at`) VALUES ('team_1', 'descr_1', '2015-07-26 19:52:52', '2015-07-26 19:52:52')
---
      def create
        @team = Team.new(team_params)

        if @team.save

SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 14 LIMIT 1
UPDATE `teams` SET `name` = 'team_1', `updated_at` = '2015-07-28 19:22:27' WHERE `teams`.`id` = 14
---
      def update
        @team = Team.find(params[:id])

        if @team.update_attributes(team_params)

SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 16 LIMIT 1
DELETE FROM `teams` WHERE `teams`.`id` = 16
---
      def destroy
        @team = Team.find(params[:id])
        @team.destroy